joristork/robots/jobot_in_c/microchip_extras/h/p18f2331.h
/*-------------------------------------------------------------------------
 * MPLAB-Cxx  PIC18F2331 processor header
 *
 * (c) Copyright 1999-2010 Microchip Technology, All rights reserved
 *-------------------------------------------------------------------------*/

#ifndef __18F2331_H
#define __18F2331_H

extern volatile near unsigned char       DFLTCON;
extern volatile near union {
  struct {
    unsigned FLTCK:3;
    unsigned FLT1EN:1;
    unsigned FLT2EN:1;
    unsigned FLT3EN:1;
    unsigned FLT4EN:1;
  };
  struct {
    unsigned FLTCK0:1;
    unsigned FLTCK1:1;
    unsigned FLTCK2:1;
  };
} DFLTCONbits;
extern volatile near unsigned char       CAP3CON;
extern volatile near union {
  struct {
    unsigned CAP3M:4;
    unsigned :1;
    unsigned CAP3TMR:1;
    unsigned CAP3REN:1;
  };
  struct {
    unsigned CAP3M0:1;
    unsigned CAP3M1:1;
    unsigned CAP3M2:1;
    unsigned CAP3M3:1;
  };
} CAP3CONbits;
extern volatile near unsigned char       CAP2CON;
extern volatile near union {
  struct {
    unsigned CAP2M:4;
    unsigned :1;
    unsigned CAP2TMR:1;
    unsigned CAP2REN:1;
  };
  struct {
    unsigned CAP2M0:1;
    unsigned CAP2M1:1;
    unsigned CAP2M2:1;
    unsigned CAP2M3:1;
  };
} CAP2CONbits;
extern volatile near unsigned char       CAP1CON;
extern volatile near union {
  struct {
    unsigned CAP1M:4;
    unsigned :1;
    unsigned CAP1TMR:1;
    unsigned CAP1REN:1;
  };
  struct {
    unsigned CAP1M0:1;
    unsigned CAP1M1:1;
    unsigned CAP1M2:1;
    unsigned CAP1M3:1;
  };
} CAP1CONbits;
extern volatile near unsigned char       CAP3BUFL;
extern volatile near unsigned char       MAXCNTL;
extern volatile near unsigned char       CAP3BUFH;
extern volatile near unsigned char       MAXCNTH;
extern volatile near unsigned char       CAP2BUFL;
extern volatile near unsigned char       POSCNTL;
extern volatile near unsigned char       CAP2BUFH;
extern volatile near unsigned char       POSCNTH;
extern volatile near unsigned char       CAP1BUFL;
extern volatile near unsigned char       VELRL;
extern volatile near unsigned char       CAP1BUFH;
extern volatile near unsigned char       VELRH;
extern volatile near unsigned char       OVDCONS;
extern volatile near union {
  struct {
    unsigned POUT:8;
  };
  struct {
    unsigned POUT0:1;
    unsigned POUT1:1;
    unsigned POUT2:1;
    unsigned POUT3:1;
    unsigned POUT4:1;
    unsigned POUT5:1;
    unsigned POUT6:1;
    unsigned POUT7:1;
  };
} OVDCONSbits;
extern volatile near unsigned char       OVDCOND;
extern volatile near union {
  struct {
    unsigned POVD:8;
  };
  struct {
    unsigned POVD0:1;
    unsigned POVD1:1;
    unsigned POVD2:1;
    unsigned POVD3:1;
    unsigned POVD4:1;
    unsigned POVD5:1;
    unsigned POVD6:1;
    unsigned POVD7:1;
  };
} OVDCONDbits;
extern volatile near unsigned char       FLTCONFIG;
extern volatile near struct {
  unsigned FLTAEN:1;
  unsigned FLTAMOD:1;
  unsigned FLTAS:1;
  unsigned FLTCON:1;
  unsigned FLTBEN:1;
  unsigned FLTBMOD:1;
  unsigned FLTBS:1;
  unsigned BRFEN:1;
} FLTCONFIGbits;
extern volatile near unsigned char       DTCON;
extern volatile near union {
  struct {
    unsigned DTA:6;
    unsigned DTAPS:2;
  };
  struct {
    unsigned DT0:1;
    unsigned DT1:1;
    unsigned DT2:1;
    unsigned DT3:1;
    unsigned DT4:1;
    unsigned DT5:1;
    unsigned DTPS0:1;
    unsigned DTPS1:1;
  };
  struct {
    unsigned DTA0:1;
    unsigned DTA1:1;
    unsigned DTA2:1;
    unsigned DTA3:1;
    unsigned DTA4:1;
    unsigned DTA5:1;
    unsigned DTAPS0:1;
    unsigned DTAPS1:1;
  };
} DTCONbits;
extern volatile near unsigned char       PWMCON1;
extern volatile near union {
  struct {
    unsigned OSYNC:1;
    unsigned UDIS:1;
    unsigned :1;
    unsigned SEVTDIR:1;
    unsigned SEVOPS:4;
  };
  struct {
    unsigned :4;
    unsigned SEVOPS0:1;
    unsigned SEVOPS1:1;
    unsigned SEVOPS2:1;
    unsigned SEVOPS3:1;
  };
} PWMCON1bits;
extern volatile near unsigned char       PWMCON0;
extern volatile near union {
  struct {
    unsigned PMOD:4;
    unsigned PWMEN:3;
  };
  struct {
    unsigned PMOD0:1;
    unsigned PMOD1:1;
    unsigned PMOD2:1;
    unsigned PMOD3:1;
    unsigned PWMEN0:1;
    unsigned PWMEN1:1;
    unsigned PWMEN2:1;
  };
} PWMCON0bits;
extern volatile near unsigned char       SEVTCMPH;
extern volatile near unsigned char       SEVTCMPL;
extern volatile near unsigned char       PDC2H;
extern volatile near unsigned char       PDC2L;
extern volatile near unsigned char       PDC1H;
extern volatile near unsigned char       PDC1L;
extern volatile near unsigned char       PDC0H;
extern volatile near unsigned char       PDC0L;
extern volatile near unsigned char       PTPERH;
extern volatile near unsigned char       PTPERL;
extern volatile near unsigned char       PTMRH;
extern volatile near unsigned char       PTMRL;
extern volatile near unsigned char       PTCON1;
extern volatile near struct {
  unsigned :6;
  unsigned PTDIR:1;
  unsigned PTEN:1;
} PTCON1bits;
extern volatile near unsigned char       PTCON0;
extern volatile near union {
  struct {
    unsigned PTMOD:2;
    unsigned PTCKPS:2;
    unsigned PTOPS:4;
  };
  struct {
    unsigned PTMOD0:1;
    unsigned PTMOD1:1;
    unsigned PTCKPS0:1;
    unsigned PTCKPS1:1;
    unsigned PTOPS0:1;
    unsigned PTOPS1:1;
    unsigned PTOPS2:1;
    unsigned PTOPS3:1;
  };
} PTCON0bits;
extern volatile near unsigned char       PORTA;
extern volatile near union {
  struct {
    unsigned RA0:1;
    unsigned RA1:1;
    unsigned RA2:1;
    unsigned RA3:1;
    unsigned RA4:1;
    unsigned :1;
    unsigned RA6:1;
    unsigned RA7:1;
  };
  struct {
    unsigned AN0:1;
    unsigned AN1:1;
    unsigned AN2:1;
    unsigned AN3:1;
    unsigned AN4:1;
    unsigned :1;
    unsigned OSC2:1;
    unsigned OSC1:1;
  };
  struct {
    unsigned :2;
    unsigned VREFM:1;
    unsigned VREFP:1;
    unsigned :2;
    unsigned CLKO:1;
    unsigned CLKI:1;
  };
} PORTAbits;
extern volatile near unsigned char       PORTB;
extern volatile near struct {
  unsigned RB0:1;
  unsigned RB1:1;
  unsigned RB2:1;
  unsigned RB3:1;
  unsigned RB4:1;
  unsigned RB5:1;
  unsigned RB6:1;
  unsigned RB7:1;
} PORTBbits;
